Aprovechamos la imagen de docker para conectarno as dw netflix

In [1]:
import pandas as pd
import sqlalchemy as sa

In [3]:
engine = sa.create_engine("mysql://root:root@172.16.5.4:3310/dw_netflix")
conn = engine.connect()

Leer algunas tablas

In [6]:
query = 'SELECT * FROM FactWatchs'
fact_watchs = pd.read_sql(query, conn)
fact_watchs.head(5)

    userID   movieID  rating           timestamp
0  1002331  80192187     4.9 2024-02-29 14:23:17
1  1002331  80210920     3.0 2024-03-30 08:26:36
2  1002331  81157374     3.9 2024-02-17 16:58:53
3  1002332  80192187     4.5 2024-02-06 23:04:16
4  1002332  80210920     2.3 2024-03-19 16:10:02

In [7]:
query = 'SELECT * FROM dimUser'
user = pd.read_sql(query, conn)
user.head(5)

    userID     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [8]:
query = 'SELECT * FROM dimMovie'
movie = pd.read_sql(query, conn)
movie.head(5)

,movieID,title,releaseMovie,gender,participantName,roleparticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy

Cálculos básicos

In [13]:
# rating promedio por pelicula
# sin especificar columna a agregar, groupby toma la ultima columna no agrupada
fact_watchs[['movieID', 'rating']].groupby('movieID', as_index=False).mean()

    movieID  rating
0  80192187   2.630
1  80210920   2.380
2  81157374   2.435

In [18]:
# especificando la columna no es necesario filtrar el dataset con una mascara
fact_watchs.groupby('movieID', as_index=False)['rating'].mean()

    movieID  rating
0  80192187   2.630
1  80210920   2.380
2  81157374   2.435

In [16]:
# rating promedio por usuario
fact_watchs[['userID', 'rating']].groupby('userID', as_index=False).mean()

      userID    rating
0    1002331  3.933333
1    1002332  3.266667
2    1002333  0.800000
3    1002334  0.733333
4    1002335  1.900000
5    1002336  2.600000
6    1002337  2.266667
7    1002338  4.000000
8    1002339  1.866667
9   10023310  3.033333
10  10023311  3.500000
11  10023312  2.233333
12  10023313  3.566667
13  10023314  1.666667
14  10023315  2.166667
15  10023316  3.266667
16  10023317  3.633333
17  10023318  0.700000
18  10023319  2.133333
19  10023320  2.366667

In [22]:
# promedio rating por usuarios premium
fact_watchs.merge(user.query("subscription == 'Premium'"), on='userID').groupby('userID')['rating'].mean()

userID
1002331     3.933333
1002333     0.800000
1002335     1.900000
1002337     2.266667
1002339     1.866667
10023311    3.500000
10023313    3.566667
10023315    2.166667
10023317    3.633333
10023319    2.133333
Name: rating, dtype: float64

In [26]:
#promedio por rango de tiempo
fact_watchs.query("timestamp >= '2024-02-01' & (timestamp <= '2024-02-07')").groupby('movieID', as_index= False)['rating'].mean()

    movieID  rating
0  80192187     4.5
1  80210920     0.8